app/Controllers/Alquileres.php

    public function mostrarAlquileres()
    {
        $idUsuario = session()->get('id_usuario');

        // Validar sesión
        if (!$idUsuario) {

            return redirect()->to('/login');
        }

        /*
        |--------------------------------------------------------------------------
        | Obtener alquileres + información del vehículo
        |--------------------------------------------------------------------------
        */
        $alquileres = $this->alquileresModel
            ->select('
                alquileres.*,
                vehiculos.marca,
                vehiculos.modelo,
                vehiculos.imagen,
                vehiculos.tipo_vehiculo,
                vehiculos.precio_alquiler_dia
            ')
            ->join(
                'vehiculos',
                'vehiculos.id_vehiculo = alquileres.id_vehiculo'
            )
            ->where('alquileres.id_usuario', $idUsuario)
            ->orderBy('alquileres.id_alquiler', 'DESC')
            ->findAll();
---
SELECT `alquileres`.*, `vehiculos`.`marca`, `vehiculos`.`modelo`, `vehiculos`.`imagen`, `vehiculos`.`tipo_vehiculo`, `vehiculos`.`precio_alquiler_dia`
FROM `alquileres`
JOIN `vehiculos` ON `vehiculos`.`id_vehiculo` = `alquileres`.`id_vehiculo`
WHERE `alquileres`.`id_usuario` = '2'
ORDER BY `alquileres`.`id_alquiler` DESC