app/Controllers/AlquileresController.php

SELECT `alquileres`.*, `vehiculos`.`marca`, `vehiculos`.`modelo`, `vehiculos`.`imagen`, `vehiculos`.`tipo_vehiculo`, `vehiculos`.`precio_alquiler_dia`
FROM `alquileres`
JOIN `vehiculos` ON `vehiculos`.`id_vehiculo` = `alquileres`.`id_vehiculo`
WHERE `alquileres`.`id_usuario` = '7'
ORDER BY `alquileres`.`id_alquiler` DESC
---
    public function mostrarAlquileres()
    {
        $idUsuario = session()->get('id_usuario');

        if (!$idUsuario) {
            return redirect()->to('/login');
        }

        // Obtener alquileres con información detallada del vehículo
        $alquileres = $this->alquileresModel
            ->select('
                alquileres.*,
                vehiculos.marca,
                vehiculos.modelo,
                vehiculos.imagen,
                vehiculos.tipo_vehiculo,
                vehiculos.precio_alquiler_dia
            ')
            ->join(
                'vehiculos',
                'vehiculos.id_vehiculo = alquileres.id_vehiculo'
            )
            ->where('alquileres.id_usuario', $idUsuario)
            ->orderBy('alquileres.id_alquiler', 'DESC')
            ->findAll();

SELECT `alquileres`.*, `vehiculos`.`marca`, `vehiculos`.`modelo`, `vehiculos`.`tipo_vehiculo`, `usuarios`.`nombre_usuario`, `usuarios`.`apellido_usuario`
FROM `alquileres`
JOIN `vehiculos` ON `vehiculos`.`id_vehiculo` = `alquileres`.`id_vehiculo`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `alquileres`.`id_usuario`
ORDER BY `alquileres`.`id_alquiler` DESC
---
    public function listarAlquileresAdmin()
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login');
        }

        if (session()->get('rol') != 'administrador') {
            return redirect()->to('/');
        }

        // Obtener todos los alquileres con datos del vehículo y cliente
        $alquileres = $this->alquileresModel
            ->select('
                alquileres.*,
                vehiculos.marca,
                vehiculos.modelo,
                vehiculos.tipo_vehiculo,
                usuarios.nombre_usuario,
                usuarios.apellido_usuario
            ')
            ->join(
                'vehiculos',
                'vehiculos.id_vehiculo = alquileres.id_vehiculo'
            )
            ->join(
                'usuarios',
                'usuarios.id_usuario = alquileres.id_usuario'
            )
            ->orderBy('alquileres.id_alquiler', 'DESC')
            ->findAll();