app/Controllers/ClientesController.php

    public function solicitarReserva($id_vehiculo)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login')->with('error_login', 'Debes iniciar sesión para realizar una reserva.');
        }

        $vehiculo = $this->vehiculosModel->find($id_vehiculo);
---
SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`deleted_at` IS NULL
AND `vehiculos`.`id_vehiculo` = '1'

    public function resumenReserva()
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login')->with('error_login', 'Debes iniciar sesión para ver el resumen de reserva.');
        }

        $temp = session()->get('temp_reserva');

        if (!$temp) {
            return redirect()->to('/')->with('toast_warning', 'No hay ninguna sesión de reserva activa.');
        }

        $vehiculo = $this->vehiculosModel->find($temp['id_vehiculo']);
---
SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`deleted_at` IS NULL
AND `vehiculos`.`id_vehiculo` = '1'

    public function confirmarReserva()
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login')->with('error_login', 'Debes iniciar sesión para confirmar la reserva.');
        }

        $temp = session()->get('temp_reserva');

        if (!$temp) {
            return redirect()->to('/')->with('toast_warning', 'No hay ninguna sesión de reserva activa para confirmar.');
        }

        // Verificar disponibilidad una última vez
        $vehiculo = $this->vehiculosModel->find($temp['id_vehiculo']);
        if (!$vehiculo || $vehiculo['disponibilidad'] !== 'disponible') {
            session()->remove('temp_reserva');
            return redirect()->to('/')->with('toast_warning', 'El vehículo ya no está disponible para reserva.');
        }

        // Insertar nuevo alquiler
        $alquilerDatos = [
            'fecha_desde'   => $temp['fecha_desde'],
            'cantidad_dias' => $temp['cantidad_dias'],
            'fecha_hasta'   => $temp['fecha_hasta'],
            'id_vehiculo'   => $temp['id_vehiculo'],
            'id_usuario'    => session()->get('id_usuario'),
            'estado'        => 'reserva'
        ];

        if ($this->alquileresModel->insert($alquilerDatos)) {
            // Actualizar disponibilidad de vehículo a no_disponible
            $this->vehiculosModel->update($temp['id_vehiculo'], [
                'disponibilidad' => 'no_disponible'
            ]);
---
SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`deleted_at` IS NULL
AND `vehiculos`.`id_vehiculo` = '2'
INSERT INTO `alquileres` (`fecha_desde`, `cantidad_dias`, `fecha_hasta`, `id_vehiculo`, `id_usuario`, `estado`) VALUES ('2026-05-25', 3, '2026-05-28', '2', '1', 'reserva')
UPDATE `vehiculos` SET `disponibilidad` = 'no_disponible'
WHERE `vehiculos`.`id_vehiculo` IN ('2')