app/Controllers/InicioController.php

    public function index()
    {
        $vehiculosModel = new VehiculosModel();
        $data['vehiculos'] = $vehiculosModel->findAll();
---
SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`deleted_at` IS NULL