app/Controllers/Inicio.php

    public function index()
    {
        $vehiculoModel = new VehiculoModel();

        $data['vehiculos'] = $vehiculoModel->findAll();
---
SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`deleted_at` IS NULL