app/Controllers/LoginController.php

SELECT *
FROM `usuarios`
WHERE `nombre_usuario` = 'octavio'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1
---
    public function validar()
    {
        $nombreUsuario = $this->request->getPost('nombre_usuario');
        $claveUsuario  = $this->request->getPost('password');

        $userModel = new UsuariosModel();
        $usuario = $userModel->where('nombre_usuario', $nombreUsuario)->first();