app/Controllers/VehiculosController.php

    public function index()
    {
        $data['vehiculos'] = $this->vehiculosModel->findAll();
---
SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`deleted_at` IS NULL

    public function mostrar($id = null)
    {
        if (!session()->get('logueado') || session()->get('rol') !== 'administrador') {
            return redirect()->to('/');
        }

        $vehiculo = $this->vehiculosModel->find($id);
---
SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`deleted_at` IS NULL